# IFC_CreateDS

## Description
Creates Data Sheet for object.

```pascal
FUNCTION IFC_CreateDS(
				objectName    : STRING;
				dataSheetName : STRING) : BOOLEAN;
```

```python

def vs.IFC_CreateDS(objectName, dataSheetName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectName|STRING||
|dataSheetName|STRING||

## Version
Availability: from Vectorworks 2023.4
## Category
* IFC